cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
        // Start Packet processor
        startPacketProcessor();

        BaseType_t task_code = xTaskCreatePinnedToCore(handle_interrupt_task,
            "handle_interrupt_task", 8192,
            this, configMAX_PRIORITIES - 1,// Before FHSS
             &handle_interrupt, xPortGetCoreID());
        if (task_code != pdPASS) {
            ets_printf("ERROR STATEMACHINE Can't create task %d\n", task_code);
            return;
        }
    }

    /**
     * @brief Returns a pointer to a single instance of the `iohcRadio`
     * class, creating it if it doesn't already exist.
     *
     * @return An instance of the `iohcRadio` class.
     */
    iohcRadio *iohcRadio::getInstance() {
        if (!_iohcRadio)
            _iohcRadio = new iohcRadio();
        return _iohcRadio;
    }
    /**
     * Initializes the radio with specified parameters and sets it to receive mode.
     */
    void iohcRadio::start(uint8_t num_freqs, uint32_t *scan_freqs, uint32_t scanTimeUs,
                          CallbackFunction rxCallback = nullptr, CallbackFunction txCallback = nullptr) {
        this->num_freqs = num_freqs;
        this->scan_freqs = scan_freqs;
        // this->scanTimeUs = scanTimeUs ? scanTimeUs : DEFAULT_SCAN_INTERVAL_US;
        this->rxCB = std::move(rxCallback);
        this->txCB = std::move(txCallback);
        this->currentFreqIdx = 0;
        this->expectingResponse = false;

        // Default
        if (scanTimeUs == 0) {
            this->scanTimeUs = 30 * 1000; // 15ms par fréquence
        } else {
            this->scanTimeUs = scanTimeUs;
        }

        Radio::clearBuffer();
        Radio::clearFlags();

        /* We always start at freq[0], the 1W/2W channel*/
        Radio::setCarrier(Radio::Carrier::Frequency, scan_freqs[0]); // CHANNEL2); // 868950000);

        if (this->num_freqs > 1) {
            this->currentFreqIdx = 0;

            // start adaptative
            // adaptiveFHSS = new AdaptiveFHSS(this);

            // Start Frequency Hopping Timer
            // adaptiveFHSS->switchToFastScan(17); // ...ms par fréquence
            ets_printf("FHSSTimer Handler Started...\n");
        }
        Radio::setRx();
    }

    /**
    */
    void IRAM_ATTR iohcRadio::tickerCounter(iohcRadio *radio, const RadioIrqEvent &evt) {
        // Radio::readBytes(REG_IRQFLAGS1, _flags, sizeof(_flags));
        // Sync = preamble end
        // if (_flags[0] & RF_IRQFLAGS1_SYNCADDRESSMATCH) {  }
        // if (radioState == RadioState::PREAMBLE) {  }
        // else
            if (radioState == RadioState::PAYLOAD) {
        // if (_flags[1] & RF_IRQFLAGS2_PAYLOADREADY) {
            // Payload ready
            radio->receive(false, evt);
            Radio::clearFlags(); // After receive
            if (!txMode) {
                // radio->unlockFHSS(FHSSLockReason::RECEIVING); // ← Good one
            }
            radio->tickCounter = 0;
        }
    }

    /**
    */
    static TxPacketWrapper* createPacketWrapper(iohcPacket* sourcePacket) {
        if (!sourcePacket) {
            return nullptr;
        }

        // Try to allocate copy of package first
        iohcPacket* pktToSend = nullptr;

        pktToSend = new (std::nothrow) iohcPacket(*sourcePacket);
        if (!pktToSend) {
            return nullptr;  // Zero leakage - nothing has been allocated
        }

        // Then allocate the wrapper
        auto wrapper = new (std::nothrow) TxPacketWrapper(pktToSend);
        if (!wrapper) {
            // Release the package
            delete pktToSend;
            return nullptr;  // Zero leak
        }

        return wrapper;
    }
    /**
     * Sends packets stored in a vector with a specified repeat time.
     *
     * @param TxPackets `Vector of pointers to `iohcPacket` objects.
    *
* Sends one or more packets
     * Packages are COPIED internally, we retain ownership of the originals
     */
    bool iohcRadio::send(std::vector<iohcPacket *> &TxPackets) {
        if (TxPackets.empty()) {
            return false;
        }
        if (xSemaphoreTake(txQueue_binary_sem, pdMS_TO_TICKS(100)) != pdTRUE) {
            return false;
        }

        txCounter = 0;
        size_t packetsAdded = 0;
        // Add each packet to the queue (making a COPY)
        for (auto *pkt: TxPackets) {
            if (pkt) {
                // Use la factory
                if (TxPacketWrapper* wrapper = createPacketWrapper(pkt)) {
                    txQueue.push_back(wrapper);
                    //pkt = nullptr; // Transfer ownership
                    packetsAdded++;
                }
            }
        }
        TxPackets.clear();
        xSemaphoreGive(txQueue_binary_sem);

        if (packetsAdded == 0) {
            ets_printf("send(): no packets added");
            return false;
        }

        startTransmission();
        return true;

    }

    /**
     * Send a single packet, to help reveiced the answer in another frequency
     */
    bool iohcRadio::sendSingle(iohcPacket *packet) {
        if (!packet) return false;
        if (TxPacketWrapper* wrapper = createPacketWrapper(packet))
            txQueue.push_back(wrapper);
        else {
            return false;
        }
        startTransmission();
        return true;
    }

    /**
    * Insère un paquet en priorité (au début de la queue)
    * Pour les réponses urgentes
    */
    bool iohcRadio::sendPriority(iohcPacket *packet) {
        if (!packet) return false;
        // O(1)
        if (TxPacketWrapper* wrapper = createPacketWrapper(packet)) txQueue.push_front(wrapper);
        else {
            return false;
        }
        startTransmission();
        return true;
    }

    /**

    */
    void IRAM_ATTR iohcRadio::packetSender(iohcRadio *radio) {
        if (!radio || !radio->currentTxPacket) {
            ets_printf("packetSender called with null pointer\n");
            return;
        }

        // Lock for transmission
        txMode = true;

        iohcPacket *pkt = radio->currentTxPacket->packet;

