cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
        // Use the frequency of the packet if specified. 1W is always set at CHANNEL2
        if (pkt->frequency == 0) pkt->frequency = radio->scan_freqs[radio->currentFreqIdx];;
        if (pkt->frequency != radio->scan_freqs[radio->currentFreqIdx]) {
            Radio::setCarrier(Radio::Carrier::Frequency, pkt->frequency);
        } else {
            pkt->frequency = radio->scan_freqs[radio->currentFreqIdx];
        }

        // Radio::setStandby();
        // Radio::clearFlags();
        radio->setRadioState(RadioState::TX);
        Radio::setTx();
        Radio::writeBurst(REG_FIFO, pkt->payload.buffer, pkt->buffer_length);
        // There is no need to maintain radio locked between packets transmission unless clearly asked
        txMode = pkt->lock;

        packetStamp = esp_timer_get_time();

        pkt->decode(true);
        // Memorize last command sent
        IOHC::lastCmd = pkt->cmd();
        IOHC::lastData = pkt->data();

        if (pkt->repeat > 0) {
            // Only the first frame is LPM (1W)
            pkt->payload.packet.header.CtrlByte2.asStruct.LPM = 0;
            pkt->repeat--;
        }
        if (pkt->repeat == 0) {
            radio->Ticker.detach();

            // Check if there is a delay before the next packet
            bool hasNextPacket = false;
            uint32_t nextDelay = 0;

            // QUICK CHECK without modifying the queue
            if (!radio->txQueue_busy && !radio->txQueue.empty()) {
                hasNextPacket = true;
                nextDelay = radio->txQueue.front()->repeatTime;
            }

            if (hasNextPacket && nextDelay > 0) {
                // Delay before next packet
                radio->Ticker.attach_ms(nextDelay, processNextPacketCallback, radio);
            } else if (hasNextPacket) {
                // No delay, process immediately
                radio->processNextPacket();
            } else {
                // No more packets to send
                txMode = false;

                radio->stopTransmission();
            }
        }
    }

    /**

    */
    bool IRAM_ATTR iohcRadio::sent(iohcPacket *packet) {
        bool ret = false;
        if (txCB) ret = txCB(packet);
        return ret;
    }

    void iohcRadio::startPacketProcessor() {
    BaseType_t result = xTaskCreatePinnedToCore(
        packetProcessorTask,   // Function
        "PacketProcessor",     // Name
        4096,                  // Stack size
        this,                  // Parameter
        5,                     // Priority (au-dessus de la task IRQ)
        &packetProcessorTaskHandle,
        xPortGetCoreID()
    );

    if (result != pdPASS) {
        ets_printf("Failed to create packet processor task\n");
    }
}

void IRAM_ATTR iohcRadio::packetProcessorTask(void* parameter) {

    auto radio = static_cast<iohcRadio*>(parameter);
    iohcPacket receivedPacket;

    ets_printf("Packet processor task started\n");

    while (true) {
        // Attendre un paquet (bloquant)
        if (xQueueReceive(radio->packetQueue, &receivedPacket, portMAX_DELAY) == pdTRUE) {
            // **CRITIQUE: Vérifier que le FHSS est dans l'état approprié**

            // **VALIDATION WITHOUT INTERRUPTION OF THE FLOW**
            bool shouldDecode = true;
            std::string rejectReason;

            // Rejection criteria (but we maintain the flow)
            if (receivedPacket.buffer_length == 0) {
                shouldDecode = false;
                rejectReason = "Empty packet";
            }
            else if (receivedPacket.buffer_length < 9/*MIN_PACKET_LENGTH*/) {
                shouldDecode = false;
                rejectReason = "Too short";
            }

            if (shouldDecode)
            if (xSemaphoreTake(radio->lastPacketMutex, pdMS_TO_TICKS(10)) == pdTRUE) {
            //         // Check for duplicates
            //         if (receivedPacket == last1wPacket && receivedPacket.is1W()) {
            //             rejectReason = "Duplicate";
            //             shouldDecode = false;
            //         } else {
            //             // Save new packet
                         last1wPacket = receivedPacket;
            //         }
            xSemaphoreGive(radio->lastPacketMutex);
            }

            // Process the package
            // **ALWAYS log, even rejections**
            if (!shouldDecode) {
                // if (rejectReason != "Duplicate")
                // ets_printf("Packet rejected: %s, len=%d\n",  rejectReason.c_str(), receivedPacket.buffer_length);
                // radio->setFHSSState(FHSSState::SCANNING);
                // radio->forceUnlockFHSS();
            } else {

                // Call the callback if defined
                if (radio->rxCB) {
                    radio->rxCB(&receivedPacket);
                }

                // Decode the packet
                receivedPacket.decode(true);
            }
        }
    }
}

    bool IRAM_ATTR iohcRadio::receive(bool stats, const RadioIrqEvent &evt) {
        // **CRITIQUE: Toujours commencer par mettre à jour l'état FHSS**
        // adaptiveFHSS->onPacketActivity();
        // setFHSSState(FHSSState::RECEIVING);

        // Use a local TEMPORARY buffer
        tempRxPacket.reset();
        tempRxPacket.frequency = scan_freqs[currentFreqIdx];

        packetStamp = evt.timestamp_us; //_g_payload_millis;

        if (stats) {
            tempRxPacket.rssi = static_cast<float>(Radio::readByte(REG_RSSIVALUE)) / -2.0f;
            int16_t thres = Radio::readByte(REG_RSSITHRESH);
            tempRxPacket.snr = tempRxPacket.rssi > thres ? 0 : (thres - tempRxPacket.rssi);
            int16_t f = static_cast<uint16_t>(Radio::readByte(REG_AFCMSB));
            f = (f << 8) | static_cast<uint16_t>(Radio::readByte(REG_AFCLSB));
            tempRxPacket.afc = f * 61.0;
        }

        // Read FIFO
        while (Radio::dataAvail()) {
            tempRxPacket.payload.buffer[tempRxPacket.buffer_length++] = Radio::readByte(REG_FIFO);
        }

        // **CRITIQUE: Toujours compléter le cycle FHSS même pour les paquets rejetés**
        // Marquer la fin de la réception pour le FHSS
        // **ALWAYS send to queue, even "invalid" packets**
        // Rejection decisions are made in the processor, not here
        // Send a COPY to the queue (thread-safe)
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        BaseType_t queueResult = xQueueSendFromISR(packetQueue, &tempRxPacket, &xHigherPriorityTaskWoken);

        // DÉVERROUILLAGE IMMÉDIAT - le paquet est dans la queue
        // Ne pas attendre le traitement complet
        // setFHSSState(FHSSState::PROCESSING);
        // Remettre en RX immédiatement
        // Radio::setRx(); // ?
        setRadioState(RadioState::RX);

        // Déverrouiller le FHSS pour permettre le hopping
        // unlockFHSS(FHSSLockReason::RECEIVING);
        // adaptiveFHSS->update();

