cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
        if (xHigherPriorityTaskWoken) {
            portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
        }

        return (queueResult == pdTRUE);
    }

    void IRAM_ATTR iohcRadio::setRadioState(const RadioState newState) {
        radioState = newState;
    }

    /**
    * Static callback for inter-packet delay
    */
    void IRAM_ATTR iohcRadio::processNextPacketCallback(iohcRadio *radio) {
        if (radio) {
            radio->processNextPacket();
        }
    }

    /**
    * Starts transmission if not already in progress
    */
    void IRAM_ATTR iohcRadio::startTransmission() {
        if (xSemaphoreTake(tx_mutex, pdMS_TO_TICKS(10)) != pdTRUE) {
            return;
        }

        if (!isSending) {
            isSending = true;
            xSemaphoreGive(tx_mutex);

            // Launch the first packet
            processNextPacket();
        } else {
            xSemaphoreGive(tx_mutex);
        }
    }

    /**
     * Process Next Packet in Queue
     */
    bool IRAM_ATTR iohcRadio::processNextPacket() {
        // Clean current packet
        if (currentTxPacket) {
            delete currentTxPacket;
            currentTxPacket = nullptr;
        }

        if (txQueue.empty()) {
            stopTransmission();
            return false;
        }

        currentTxPacket = txQueue.front();
        txQueue.pop_front();
        // Check validity
        if (!currentTxPacket || !currentTxPacket->packet) {
            ets_printf("processNextPacket(): Invalid packet!\n");
            stopTransmission();
            return false;
        }

        // Start packet timer
        uint32_t repeatTime = currentTxPacket->repeatTime;
        if (repeatTime == 0) repeatTime = 50;  // Default if not specified

        // Reattach the Ticker
        Ticker.attach_ms(repeatTime, packetSender, this);

        return true;
    }

    /**
     * Stop Transmission
     */
    void IRAM_ATTR iohcRadio::stopTransmission() {
        if (xSemaphoreTake(tx_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
            isSending = false;
            Ticker.detach();

            // Clean current packet
            if (currentTxPacket) {
                delete currentTxPacket;
                currentTxPacket = nullptr;
            }
            // Mark as not sending
            isSending = false;

            txMode = false;
            // unlockFHSS(FHSSLockReason::TRANSMITTING);
            // setExpectingResponse(true, 25);

            xSemaphoreGive(tx_mutex);
        }
    }

    /**
     * Clean TX Queue
     */
    void IRAM_ATTR iohcRadio::clearTxQueue() {
        while (!txQueue.empty()) {
            const TxPacketWrapper *wrapper = txQueue.front();
            txQueue.pop_front();
            delete wrapper; // The destructor frees the memory
        }
    }

    /**
    * Check if currently transmitting
    */
    bool IRAM_ATTR iohcRadio::isTransmitting() const {
        bool transmitting = false;
        if (xSemaphoreTake(tx_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
            transmitting = isSending;
            xSemaphoreGive(tx_mutex);
        }
        return transmitting;
    }

    /**
     * Clean TX Queue and stop transmission
     */
    void IRAM_ATTR iohcRadio::cancelTransmissions() {
        Ticker.detach();
        clearTxQueue();
        stopTransmission();
    }
}
